raw/Using-results-from-one-code-block-in-another-org-mode.org
#+TITLE: Using results from one code block in another org-mode
#+URL: http://kitchingroup.cheme.cmu.edu/org/2019/02/12/Using-results-from-one-code-block-in-another-org-mode.org
#+AUTHOR: lujun9972
#+TAGS: raw
#+DATE: [2019年 03月 05日 星期二 18:15:29 CST]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* DONE Using results from one code block in another org-mode
  CLOSED: [2019-02-12 Tue 09:20]
  :PROPERTIES:
  :categories: emacs,elisp,orgmode
  :date:     2019/02/12 09:20:58
  :updated:  2019/02/25 14:17:16
  :org-url:  http://kitchingroup.cheme.cmu.edu/org/2019/02/12/Using-results-from-one-code-block-in-another-org-mode.org
  :permalink: http://kitchingroup.cheme.cmu.edu/blog/2019/02/12/Using-results-from-one-code-block-in-another-org-mode/index.html
  :END:

One really great feature in org-mode is you have many options to pass data between code-blocks. In this post we look at some of these options using emacs-lisp as the language. This runs in a /session/ where you can keep variables in memory between blocks, and use them in subsequent blocks.

Here we set a variable to a value.

#+BEGIN_SRC emacs-lisp
(setq some-variable 42)
#+END_SRC

#+RESULTS:
: 42

Then later in another block we can use that variable:

#+BEGIN_SRC emacs-lisp
(+ some-variable 1)
#+END_SRC

#+RESULTS:
: 43

While you are in the session, =some-variable= can be used. If you want some mind-bending trouble, the emacs-lisp session is global, and you can access =some-variable= even in another buffer! Don't do that. When you close emacs this variable will disappear, and all that is left are the results from above.

There is another way to pass information from one block to another using named src blocks and variables in the block header. This allows you to pass data between blocks by name, and you will see later you can even access the results by name from other files.

** :var

First, we give our src block a name like this:

#+BEGIN_EXAMPLE
#+name: block-1
#+BEGIN_SRC emacs-lisp
(current-time-string)
#+END_SRC
#+END_EXAMPLE

When we run this, the results will have a name too.

#+name: block-1
#+BEGIN_SRC emacs-lisp
(current-time-string)
#+END_SRC

#+RESULTS: block-1
: Tue Feb 12 08:19:23 2019

Now, we can use the named result as /input/ to a new block using the :var header.

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :var input=block-1
(format "We got %S in block-1" input)
#+END_SRC
#+END_EXAMPLE

When we run this block, emacs will run block-1 and put the output in to the variable =input= which we use inside the code block.

#+BEGIN_SRC emacs-lisp :var input=block-1
(format "We got %S in block-1" input)
#+END_SRC

#+RESULTS:
: We got "Tue Feb 12 08:20:44 2019" in block-1

Some things to note:
1. Every time you run this, block-1 gets rerun.
2. The results in this block are not the same as in block-1
3. The results in block-1 are not changed when you run the second block.

You may not want to rerun block-1 each time; maybe it is an expensive calculation, or maybe it should not be changed. You can prevent this behavior by using the :cache header.

** :cache

If you specify =:cache yes= then org-mode /should/ store a hash of the code block with the results, and if the code block hasn't changed then it should not run again.

#+BEGIN_EXAMPLE
#+name: block-2
#+BEGIN_SRC emacs-lisp :cache yes
(current-time-string)
#+END_SRC
#+END_EXAMPLE

#+name: block-2
#+BEGIN_SRC emacs-lisp :cache yes
(current-time-string)
#+END_SRC

#+RESULTS[16a95c8b6a2ad5f5f5ed18b60f13c5b8904ba8d6]: block-2
: Tue Feb 12 08:06:22 2019

Now, we use block-2 as input to a block, we see the output is the same as the output from block-2.

#+BEGIN_SRC emacs-lisp :var input=block-2
(format "We got %S in block-2" input)
#+END_SRC

#+RESULTS:
: We got "Tue Feb 12 08:06:22 2019" in block-2

Ok, but what if my results are too large to put in the buffer, or too complex for text? You still have some options.

** :wrap

Suppose we generate some json in one block, and we want to use it in another block. We still want to see the json in the buffer as an intermediate result. We can wrap the output in a json block like this.

#+name: json
#+BEGIN_SRC emacs-lisp :wrap json :cache yes
(require 'json)
(json-encode `(("date" . ,(current-time-string))))
#+END_SRC

#+RESULTS[2daea688af88cfac7bd5862c0b42c69351d516dd]: json
#+begin_json
{"date":"Tue Feb 12 08:30:20 2019"}
#+end_json

Then, we can simply input that output into a new block.

#+BEGIN_SRC emacs-lisp :var input=json
(format "We got %S in json" input)
#+END_SRC

#+RESULTS:
: We got "{\"date\":\"Tue Feb 12 08:30:20 2019\"}
: " in json

This admittedly still pretty simple, text-based data. It is probably not a good idea to do this with binary data.

Note you can refer to this result even in another org-file:

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :var input=./2019-02-12.org:json
input
#+END_SRC

#+RESULTS:
: {"date":"Tue Feb 12 08:30:20 2019"}
#+END_EXAMPLE


