blog/2019/03/05/using-results-from-one-code-block-in-another-org-mode/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Using results from one code block in another org-mode - EMACS-DOCUMENT</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="lujun9972" />
  <meta name="keywords" content="raw" />
  <!-- <link rel="stylesheet" href="../../../../../media/css/main.css" type="text/css"/>
       <link rel="stylesheet" href="../../../../../media/css/comment.css" type="text/css"/> -->
  <link rel='stylesheet' href='https://cdn.jsdelivr.net/gh/kognise/water.css@latest/dist/dark.css'>
  <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/gitalk@1/dist/gitalk.css">
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="../../../../../">EMACS-DOCUMENT</a></h1>
    <p>=============&gt;集思广益</p>
    <nav class="site-nav">
      <ul class="trigger">
        <li><a href="../../../../../years/">Years</a></li>
        <li><a href="../../../../../authors/">Authors</a></li>
        <li><a href="../../../../../tags/">Tags</a></li>
        <li><a href="../../../../../about/">About</a></li>
        <li><a href="https://github.com/lujun9972/emacs-document">Github</a></li>
        <li><a href="../../../../../rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="https://www.bing.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="lujun9972.github.io/emacs-document">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Using results from one code block in another org-mode</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org015bf3f"><span class="done DONE">DONE</span> Using results from one code block in another org-mode</a>
<ul>
<li><a href="#org0894890">:var</a></li>
<li><a href="#orgb215ee5">:cache</a></li>
<li><a href="#org907a763">:wrap</a></li>
<li><a href="#org62f270b">:file</a></li>
<li><a href="#org28ac063">"remote" data</a></li>
<li><a href="#org51102df">Manually saving data in files</a></li>
<li><a href="#orgab34aaa">An appendix for data</a></li>
<li><a href="#org1d96bf3">Caveats</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org015bf3f" class="outline-2">
<h2 id="org015bf3f"><span class="done DONE">DONE</span> Using results from one code block in another org-mode</h2>
<div class="outline-text-2" id="text-org015bf3f">
<p>
One really great feature in org-mode is you have many options to pass data between code-blocks. In this post we look at some of these options using emacs-lisp as the language. This runs in a <i>session</i> where you can keep variables in memory between blocks, and use them in subsequent blocks.
</p>

<p>
Here we set a variable to a value.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">setq</span> some-variable <span style="color: #a45bad;">42</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
42

</pre>

<p>
Then later in another block we can use that variable:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>+ some-variable <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
43

</pre>

<p>
While you are in the session, <code>some-variable</code> can be used. If you want some mind-bending trouble, the emacs-lisp session is global, and you can access <code>some-variable</code> even in another buffer! Don't do that. When you close emacs this variable will disappear, and all that is left are the results from above.
</p>

<p>
There is another way to pass information from one block to another using named src blocks and variables in the block header. This allows you to pass data between blocks by name, and you will see later you can even access the results by name from other files.
</p>
</div>

<div id="outline-container-org0894890" class="outline-3">
<h3 id="org0894890">:var</h3>
<div class="outline-text-3" id="text-org0894890">
<p>
First, we give our src block a name like this:
</p>

<pre class="example">
#+name: block-1
#+BEGIN_SRC emacs-lisp
(current-time-string)
#+END_SRC
</pre>

<p>
When we run this, the results will have a name too.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org33e9215"><span style="color: #4f97d7;">(</span>current-time-string<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
Tue Feb 12 08:19:23 2019

</pre>

<p>
Now, we can use the named result as <i>input</i> to a new block using the :var header.
</p>

<pre class="example">
#+BEGIN_SRC emacs-lisp :var input=block-1
(format "We got %S in block-1" input)
#+END_SRC
</pre>

<p>
When we run this block, emacs will run block-1 and put the output in to the variable <code>input</code> which we use inside the code block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>format <span style="color: #2d9574;">"We got %S in block-1"</span> input<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got "Tue Feb 12 08:20:44 2019" in block-1

</pre>

<p>
Some things to note:
</p>
<ol class="org-ol">
<li>Every time you run this, block-1 gets rerun.</li>
<li>The results in this block are not the same as in block-1</li>
<li>The results in block-1 are not changed when you run the second block.</li>
</ol>

<p>
You may not want to rerun block-1 each time; maybe it is an expensive calculation, or maybe it should not be changed. You can prevent this behavior by using the :cache header.
</p>
</div>
</div>

<div id="outline-container-orgb215ee5" class="outline-3">
<h3 id="orgb215ee5">:cache</h3>
<div class="outline-text-3" id="text-orgb215ee5">
<p>
If you specify <code>:cache yes</code> then org-mode <i>should</i> store a hash of the code block with the results, and if the code block hasn't changed then it should not run again.
</p>

<pre class="example">
#+name: block-2
#+BEGIN_SRC emacs-lisp :cache yes
(current-time-string)
#+END_SRC
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org4c47941"><span style="color: #4f97d7;">(</span>current-time-string<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
Tue Feb 12 08:06:22 2019

</pre>

<p>
Now, we use block-2 as input to a block, we see the output is the same as the output from block-2.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>format <span style="color: #2d9574;">"We got %S in block-2"</span> input<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got "Tue Feb 12 08:06:22 2019" in block-2

</pre>

<p>
Ok, but what if my results are too large to put in the buffer, or too complex for text? You still have some options.
</p>
</div>
</div>

<div id="outline-container-org907a763" class="outline-3">
<h3 id="org907a763">:wrap</h3>
<div class="outline-text-3" id="text-org907a763">
<p>
Suppose we generate some json in one block, and we want to use it in another block. We still want to see the json in the buffer as an intermediate result. We can wrap the output in a json block like this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org47c7eaf"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">json</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>json-encode `<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"date"</span> . ,<span style="color: #67b11d;">(</span>current-time-string<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="json">
<p>
{"date":"Tue Feb 12 08:30:20 2019"}
</p>

</div>

<p>
Then, we can simply input that output into a new block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span>format <span style="color: #2d9574;">"We got %S in json"</span> input<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got "{\"date\":\"Tue Feb 12 08:30:20 2019\"}
" in json

</pre>

<p>
This admittedly still pretty simple, text-based data. It is probably not a good idea to do this with binary data.
</p>

<p>
Note you can refer to this result even in another org-file:
</p>

<pre class="example">
#+BEGIN_SRC emacs-lisp :var input=./2019-02-12.org:json
input
#+END_SRC

#+RESULTS:
: {"date":"Tue Feb 12 08:30:20 2019"}
</pre>
</div>
</div>
