raw/Using-results-from-one-code-block-in-another-org-mode.org
** :file

It may be that your data is too large to conveniently put into your org-file, or maybe it is binary data. No problem, just put it into an external file using the :file header. It looks like this:

#+BEGIN_EXAMPLE
#+name: block-3
#+BEGIN_SRC emacs-lisp :cache yes :file block-3
(require 'json)
(json-encode `(("date" . ,(current-time-string))))
#+END_SRC

#+RESULTS[a14d376653bd8c40a0961ca95f21d8837dddec66]: block-3
[[file:block-3]]
#+END_EXAMPLE


Note that you have to provide a file name for this. Sometimes that is nice if you want a human recognizable file to send to someone, but it would also be nice if there was an automatic naming scheme, e.g. based on an sha-1 hash of the src block.

#+name: block-3
#+BEGIN_SRC emacs-lisp :cache yes :file block-3
(require 'json)
(json-encode `(("date" . ,(current-time-string))))
#+END_SRC

#+RESULTS[a14d376653bd8c40a0961ca95f21d8837dddec66]: block-3
[[file:block-3]]

Now you can use other tools to check out the file. Here we can still use simple shell tools.

#+BEGIN_SRC sh :results code
cat block-3
#+END_SRC

#+RESULTS:
#+begin_src sh
{"date":"Tue Feb 12 08:46:55 2019"}
#+end_src


The output of block-3 is a file name:

#+BEGIN_SRC emacs-lisp :var input=block-3
input
#+END_SRC

#+RESULTS:
: /Users/jkitchin/Box Sync/kitchingroup/jkitchin/journal/2019/02/12/block-3

So you can use it in a new block to read the data in, and then do something new with it.

#+BEGIN_SRC emacs-lisp :var input=block-3
(with-temp-buffer
  (insert-file-contents input)
  (format "We got %S in block-3" (json-read-from-string (buffer-string))))
#+END_SRC

#+RESULTS:
: We got ((date . "Tue Feb 12 08:46:55 2019")) in block-3

** "remote" data

The blocks do not have to be in order. If you want, you can put your blocks in an appendix, and then just have analysis blocks here that use them. That way, you can have short blocks here that are more readable, but longer, more complex blocks elsewhere that do not clutter your document.

#+BEGIN_SRC emacs-lisp :var input=appendix-data
(with-temp-buffer
  (insert-file-contents input)
  (format "We got %S in the appendix data" (json-read-from-string (buffer-string))))
#+END_SRC

#+RESULTS:
: We got "{\"date\":\"Tue Feb 12 09:11:12 2019\"}" in the appendix data


** Manually saving data in files

Note you can also manually save data in a file, for example:

#+name: block-4
#+BEGIN_SRC emacs-lisp
(require 'json)
(let ((f "block-4.json"))
  (with-temp-file f
    (prin1
     (json-encode `(("date" . ,(current-time-string))))
     (current-buffer)))
  f)
#+END_SRC

#+RESULTS: block-4
: block-4.json

We put the filename as the last variable which is returned by the block, so that we don't have to manually type it later in the next block. You know, try not to repeat yourself...

This just shows we did write out to our file:

#+BEGIN_SRC sh
cat block-4.json
#+END_SRC

#+RESULTS:
: :\"Tue Feb 12 08:50:00 2019\"}

And we read the file in here, using the filename from block-4 as an input variable.

#+BEGIN_SRC emacs-lisp :var input=block-4
(with-temp-buffer
  (insert-file-contents input)
  (format "We got %S in block-4" (json-read-from-string (buffer-string))))
#+END_SRC

#+RESULTS:
: We got "{\"date\":\"Tue Feb 12 08:51:25 2019\"}" in block-4

** An appendix for data
   :PROPERTIES:
   :ID:       0452775B-D200-4B9B-BC09-C6935D9183A4
   :END:

#+name: appendix-data
#+BEGIN_SRC emacs-lisp
(require 'json)
(let ((f "appendix.json"))
  (with-temp-file f
    (prin1
     (json-encode `(("date" . ,(current-time-string))))
     (current-buffer)))
  f)
#+END_SRC

#+RESULTS: appendix-data
: appendix.json


