blog/2019/03/05/using-results-from-one-code-block-in-another-org-mode/index.html


<div id="outline-container-org62f270b" class="outline-3">
<h3 id="org62f270b">:file</h3>
<div class="outline-text-3" id="text-org62f270b">
<p>
It may be that your data is too large to conveniently put into your org-file, or maybe it is binary data. No problem, just put it into an external file using the :file header. It looks like this:
</p>

<pre class="example">
#+name: block-3
#+BEGIN_SRC emacs-lisp :cache yes :file block-3
(require 'json)
(json-encode `(("date" . ,(current-time-string))))
#+END_SRC

#+RESULTS[a14d376653bd8c40a0961ca95f21d8837dddec66]: block-3
[[file:block-3]]
</pre>


<p>
Note that you have to provide a file name for this. Sometimes that is nice if you want a human recognizable file to send to someone, but it would also be nice if there was an automatic naming scheme, e.g. based on an sha-1 hash of the src block.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org775890f"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">json</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>json-encode `<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"date"</span> . ,<span style="color: #67b11d;">(</span>current-time-string<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
<a href="block-3">block-3</a>
</p>

<p>
Now you can use other tools to check out the file. Here we can still use simple shell tools.
</p>

<div class="org-src-container">
<pre class="src src-sh">cat block-3
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">{</span><span style="color: #2d9574;">"date"</span>:<span style="color: #2d9574;">"Tue Feb 12 08:46:55 2019"</span><span style="color: #4f97d7;">}</span>
</pre>
</div>


<p>
The output of block-3 is a file name:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">input
</pre>
</div>

<pre class="example">
/Users/jkitchin/Box Sync/kitchingroup/jkitchin/journal/2019/02/12/block-3

</pre>

<p>
So you can use it in a new block to read the data in, and then do something new with it.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-buffer</span>
  <span style="color: #bc6ec5;">(</span>insert-file-contents input<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"We got %S in block-3"</span> <span style="color: #2d9574;">(</span>json-read-from-string <span style="color: #67b11d;">(</span>buffer-string<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got ((date . "Tue Feb 12 08:46:55 2019")) in block-3

</pre>
</div>
</div>

<div id="outline-container-org28ac063" class="outline-3">
<h3 id="org28ac063">"remote" data</h3>
<div class="outline-text-3" id="text-org28ac063">
<p>
The blocks do not have to be in order. If you want, you can put your blocks in an appendix, and then just have analysis blocks here that use them. That way, you can have short blocks here that are more readable, but longer, more complex blocks elsewhere that do not clutter your document.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-buffer</span>
  <span style="color: #bc6ec5;">(</span>insert-file-contents input<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"We got %S in the appendix data"</span> <span style="color: #2d9574;">(</span>json-read-from-string <span style="color: #67b11d;">(</span>buffer-string<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got "{\"date\":\"Tue Feb 12 09:11:12 2019\"}" in the appendix data

</pre>
</div>
</div>


<div id="outline-container-org51102df" class="outline-3">
<h3 id="org51102df">Manually saving data in files</h3>
<div class="outline-text-3" id="text-org51102df">
<p>
Note you can also manually save data in a file, for example:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orged967af"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">json</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>f <span style="color: #2d9574;">"block-4.json"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-file</span> f
    <span style="color: #2d9574;">(</span>prin1
     <span style="color: #67b11d;">(</span>json-encode `<span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"date"</span> . ,<span style="color: #bc6ec5;">(</span>current-time-string<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span>current-buffer<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  f<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
block-4.json

</pre>

<p>
We put the filename as the last variable which is returned by the block, so that we don't have to manually type it later in the next block. You know, try not to repeat yourself...
</p>

<p>
This just shows we did write out to our file:
</p>

<div class="org-src-container">
<pre class="src src-sh">cat block-4.json
</pre>
</div>

<pre class="example">
:\"Tue Feb 12 08:50:00 2019\"}

</pre>

<p>
And we read the file in here, using the filename from block-4 as an input variable.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-buffer</span>
  <span style="color: #bc6ec5;">(</span>insert-file-contents input<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>format <span style="color: #2d9574;">"We got %S in block-4"</span> <span style="color: #2d9574;">(</span>json-read-from-string <span style="color: #67b11d;">(</span>buffer-string<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
We got "{\"date\":\"Tue Feb 12 08:51:25 2019\"}" in block-4

</pre>
</div>
</div>

<div id="outline-container-orgab34aaa" class="outline-3">
<h3 id="orgab34aaa"><a id="ID-0452775B-D200-4B9B-BC09-C6935D9183A4"></a>An appendix for data</h3>
<div class="outline-text-3" id="text-orgab34aaa">
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge06cd66"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">require</span> '<span style="color: #a45bad;">json</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>f <span style="color: #2d9574;">"appendix.json"</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">with-temp-file</span> f
    <span style="color: #2d9574;">(</span>prin1
     <span style="color: #67b11d;">(</span>json-encode `<span style="color: #b1951d;">(</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"date"</span> . ,<span style="color: #bc6ec5;">(</span>current-time-string<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span>current-buffer<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  f<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
appendix.json

</pre>
</div>
</div>
